Revit 2027 API
InstanceVoidCutUtils.GetCuttingVoidInstances Method
 Return ids of the instances with unattached voids cutting the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetCuttingVoidInstances(
	Element element
)
Public Shared Function GetCuttingVoidInstances (
	element As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetCuttingVoidInstances(
	Element^ element
)
static member GetCuttingVoidInstances :
        element : Element -> ICollection<ElementId>
Parameters
element Element
 The element being cut
Return Value
ICollection<ElementId>
 Ids of instances with unattached voids that cut this element
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace